Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes
The LevelMarkAttributes class contains the attributes for the level mark.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.#ctor(System.Boolean)
Creates a new default level mark attributes instance that does not load standard attributes

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes class that loads standard attributes.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes class that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Prefix
Gets or sets the text before the level value.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.UsePositiveSignForPositiveLevels
Gets or sets a value indicating whether a + character in front of positive level value.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.TextHidden
Gets or sets a value indicating whether the numeric values are visible or hidden.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Postfix
Gets or sets text after the level value.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Unit
Gets or sets the unit attributes.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.UseGrouping
Gets or sets a value indicating whether to use different grouping options
to represent the level mark dimensions.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Angle
Gets or sets the angle of the level mark, in degrees.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Font
Gets or sets the font of the level mark text.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.Frame
Gets or sets the frame attributes for the level mark.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.TransparentBackground
Gets or sets a value indicating whether the transparency
of the background of the level mark text is enabled.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.ArrowHead
Gets or sets the arrow attributes for the level mark.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.PlacingAttributes
Gets or sets the placing attributes that the object should use.
Using these you can specify whether the object is automatically arranged in the drawing or not.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.